{
  "session_id": "sess_demo_001",
  "patient_id": "pat_demo_123",
  "clinician_role": "therapist",
  "session_date": "2024-12-15",
  "duration_minutes": 45,
  "segments": [
    {
      "id": "seg_001",
      "speaker": "clinician",
      "start_ms": 0,
      "end_ms": 8500,
      "text": "Good afternoon, Sarah. It's good to see you again. How have you been doing since our last session two weeks ago?"
    },
    {
      "id": "seg_002",
      "speaker": "patient",
      "start_ms": 9000,
      "end_ms": 25000,
      "text": "Hi. Honestly, it's been a really tough couple of weeks. The insomnia has gotten worse. I'm maybe getting three or four hours a night now, and I feel exhausted all the time."
    },
    {
      "id": "seg_003",
      "speaker": "clinician",
      "start_ms": 25500,
      "end_ms": 32000,
      "text": "I'm sorry to hear that. Three to four hours is significantly less than what you were getting before. When did you notice this change?"
    },
    {
      "id": "seg_004",
      "speaker": "patient",
      "start_ms": 32500,
      "end_ms": 52000,
      "text": "It started about a week after our last session. My mom came to stay with us, and things have been really tense. She keeps making comments about my parenting, and I just lie awake at night replaying those conversations."
    },
    {
      "id": "seg_005",
      "speaker": "clinician",
      "start_ms": 52500,
      "end_ms": 60000,
      "text": "That sounds like a significant stressor. How is your relationship with your mother typically?"
    },
    {
      "id": "seg_006",
      "speaker": "patient",
      "start_ms": 60500,
      "end_ms": 95000,
      "text": "Complicated. We've always had a difficult dynamic. She's very critical, especially about how I'm raising Emma. Last week she told me I'm too permissive and that's why Emma has tantrums. I know she's probably wrong, but it still hurts. I ended up crying in the bathroom after she left the room."
    },
    {
      "id": "seg_007",
      "speaker": "clinician",
      "start_ms": 95500,
      "end_ms": 105000,
      "text": "It sounds like her criticism really affects you deeply, even when you intellectually know it may not be accurate. How has this been impacting your mood overall?"
    },
    {
      "id": "seg_008",
      "speaker": "patient",
      "start_ms": 105500,
      "end_ms": 135000,
      "text": "My mood has definitely been lower. I've been feeling more irritable with my husband and with Emma, which I hate. I snapped at Emma yesterday for something small and then felt terrible about it. I've also noticed I don't really enjoy things the way I used to. Even reading, which I love, feels like a chore."
    },
    {
      "id": "seg_009",
      "speaker": "clinician",
      "start_ms": 135500,
      "end_ms": 150000,
      "text": "You're describing anhedonia - that loss of pleasure in activities you normally enjoy. Combined with the sleep issues and irritability, I want to check in on something. Have you had any thoughts of hurting yourself or not wanting to be here?"
    },
    {
      "id": "seg_010",
      "speaker": "patient",
      "start_ms": 150500,
      "end_ms": 175000,
      "text": "No, nothing like that. I mean, sometimes I wish I could just escape for a while, like go on vacation alone. But I don't have thoughts about hurting myself. I have Emma to think about. She needs me."
    },
    {
      "id": "seg_011",
      "speaker": "clinician",
      "start_ms": 175500,
      "end_ms": 185000,
      "text": "I'm glad to hear that, and it's clear Emma is a strong protective factor for you. Are you still taking the sertraline as prescribed?"
    },
    {
      "id": "seg_012",
      "speaker": "patient",
      "start_ms": 185500,
      "end_ms": 205000,
      "text": "Yes, 50mg every morning. I haven't missed any doses. Although I've been wondering if maybe we should increase it? A friend of mine is on 100mg and she says it helped her a lot more at that dose."
    },
    {
      "id": "seg_013",
      "speaker": "clinician",
      "start_ms": 205500,
      "end_ms": 225000,
      "text": "It's good that you're consistent with the medication. Regarding the dose, that's something to discuss with Dr. Martinez. I can include a note about your symptoms in my summary for her. How is the medication sitting with you otherwise? Any side effects?"
    },
    {
      "id": "seg_014",
      "speaker": "patient",
      "start_ms": 225500,
      "end_ms": 245000,
      "text": "The nausea went away after the first few weeks. Sometimes I feel a bit jittery in the mornings, but it passes. Nothing too bad. I just wish it was helping more with the sleep."
    },
    {
      "id": "seg_015",
      "speaker": "clinician",
      "start_ms": 245500,
      "end_ms": 265000,
      "text": "The jitteriness can be a common side effect. Let's talk about sleep hygiene for a moment. What does your typical evening routine look like now, especially since your mother arrived?"
    },
    {
      "id": "seg_016",
      "speaker": "patient",
      "start_ms": 265500,
      "end_ms": 305000,
      "text": "It's been all over the place honestly. We usually have dinner around 7, then I help Emma with homework and get her to bed by 8:30. After that, my mom and I often end up talking, which sometimes turns into arguments. By the time I go to bed, it's usually 11 or later, and my mind is racing. I've been scrolling on my phone in bed a lot too, probably until midnight most nights."
    },
    {
      "id": "seg_017",
      "speaker": "clinician",
      "start_ms": 305500,
      "end_ms": 320000,
      "text": "I'm hearing a few things there - late-night difficult conversations, phone use in bed, and going to bed with an activated mind. These are all things that can significantly impact sleep quality."
    },
    {
      "id": "seg_018",
      "speaker": "patient",
      "start_ms": 320500,
      "end_ms": 340000,
      "text": "Yeah, I know the phone thing is bad. I just can't seem to stop. It's like my brain needs the distraction. If I just lie there in the dark, all I can think about is everything I'm doing wrong."
    },
    {
      "id": "seg_019",
      "speaker": "clinician",
      "start_ms": 340500,
      "end_ms": 365000,
      "text": "That rumination pattern is really common, especially when we're stressed. Let's work on a strategy for that. Have you tried the breathing exercises we discussed last time? The 4-7-8 technique?"
    },
    {
      "id": "seg_020",
      "speaker": "patient",
      "start_ms": 365500,
      "end_ms": 385000,
      "text": "I tried it a few times but I kept losing count or getting frustrated. It felt like another thing I was failing at. Maybe I wasn't doing it right."
    },
    {
      "id": "seg_021",
      "speaker": "clinician",
      "start_ms": 385500,
      "end_ms": 410000,
      "text": "There's no wrong way to do it - the goal is just to slow your nervous system down. Let's practice it together right now, and I'll guide you through it. We can also talk about setting some boundaries with your mother around evening conversations. How does that sound?"
    },
    {
      "id": "seg_022",
      "speaker": "patient",
      "start_ms": 410500,
      "end_ms": 430000,
      "text": "Okay, that sounds good. I know I need to set boundaries with her. It's just so hard. Every time I try, she makes me feel guilty, like I'm being a bad daughter."
    },
    {
      "id": "seg_023",
      "speaker": "clinician",
      "start_ms": 430500,
      "end_ms": 455000,
      "text": "Setting boundaries with family members who trigger guilt is one of the hardest things to do. It's a skill that takes practice. For this week, I'd like you to try one small boundary - maybe ending conversations by 9 PM. We can role-play how to phrase that before you leave today."
    },
    {
      "id": "seg_024",
      "speaker": "patient",
      "start_ms": 455500,
      "end_ms": 475000,
      "text": "That would be helpful. I never know what to say that doesn't sound rude. And maybe if I can get to bed earlier with less on my mind, the sleep will improve."
    },
    {
      "id": "seg_025",
      "speaker": "clinician",
      "start_ms": 475500,
      "end_ms": 510000,
      "text": "Exactly. Let's also set up a simple wind-down routine - no phone after 10 PM, the breathing exercise, and maybe some light reading instead of screen time. We'll check in on how all of this is going in our next session. Your homework this week is the 9 PM conversation boundary and the phone-free wind-down routine. How are you feeling about that?"
    },
    {
      "id": "seg_026",
      "speaker": "patient",
      "start_ms": 510500,
      "end_ms": 525000,
      "text": "Nervous but hopeful, I guess. It feels manageable when you put it that way. Two specific things I can try."
    },
    {
      "id": "seg_027",
      "speaker": "clinician",
      "start_ms": 525500,
      "end_ms": 545000,
      "text": "That's exactly right - small, specific steps. And remember, it's okay if it's not perfect. We're looking for progress, not perfection. Let's do that breathing exercise now, and then we'll role-play the boundary conversation."
    }
  ]
}
